
## Plan Result

[CI link](https://github.com/ikigaikintore/ikigaikintore/actions/runs/7931508233)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 11 to add, 1 to change, 4 to destroy.</code></pre>

* Create
  * google_project_service.frontend-api-resources[&#34;firestore.googleapis.com&#34;]
  * google_project_service.frontend-api-resources[&#34;identitytoolkit.googleapis.com&#34;]
  * google_project_service.frontend-api-resources[&#34;serviceusage.googleapis.com&#34;]
  * google_secret_manager_secret.frontend-secrets[&#34;environment&#34;]
  * google_secret_manager_secret.frontend-secrets[&#34;firebase_api_key&#34;]
  * google_secret_manager_secret.frontend-secrets[&#34;firebase_app_id&#34;]
  * google_secret_manager_secret.frontend-secrets[&#34;firebase_auth_domain&#34;]
  * google_secret_manager_secret.frontend-secrets[&#34;firebase_messaging_sender_id&#34;]
  * google_secret_manager_secret.frontend-secrets[&#34;firebase_project_id&#34;]
  * google_secret_manager_secret.frontend-secrets[&#34;firebase_storage_bucket&#34;]
  * google_secret_manager_secret.frontend-secrets[&#34;user_auth&#34;]
* Update
  * google_artifact_registry_repository.artifact-repository
* Delete
  * google_project_service.firebase-apis[&#34;firebase.googleapis.com&#34;]
  * google_project_service.firebase-apis[&#34;serviceusage.googleapis.com&#34;]
  * google_project_service.firebase_apis[&#34;firebase.googleapis.com&#34;]
  * google_project_service.firebase_apis[&#34;serviceusage.googleapis.com&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_artifact_registry_repository.artifact-repository will be updated in-place
  ~ resource "google_artifact_registry_repository" "artifact-repository" {
        id               = "projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai"
        name             = "ikigai"
        # (10 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }
    }

  # google_project_service.firebase-apis["firebase.googleapis.com"] will be destroyed
  # (because google_project_service.firebase-apis is not in configuration)
  - resource "google_project_service" "firebase-apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/firebase.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "firebase.googleapis.com" -> null
    }

  # google_project_service.firebase-apis["serviceusage.googleapis.com"] will be destroyed
  # (because google_project_service.firebase-apis is not in configuration)
  - resource "google_project_service" "firebase-apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/serviceusage.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "serviceusage.googleapis.com" -> null
    }

  # google_project_service.firebase_apis["firebase.googleapis.com"] will be destroyed
  # (because google_project_service.firebase_apis is not in configuration)
  - resource "google_project_service" "firebase_apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/firebase.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "firebase.googleapis.com" -> null
    }

  # google_project_service.firebase_apis["serviceusage.googleapis.com"] will be destroyed
  # (because google_project_service.firebase_apis is not in configuration)
  - resource "google_project_service" "firebase_apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/serviceusage.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "serviceusage.googleapis.com" -> null
    }

  # google_project_service.frontend-api-resources["firestore.googleapis.com"] will be created
  + resource "google_project_service" "frontend-api-resources" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "gig-japan-398904"
      + service            = "firestore.googleapis.com"
    }

  # google_project_service.frontend-api-resources["identitytoolkit.googleapis.com"] will be created
  + resource "google_project_service" "frontend-api-resources" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "gig-japan-398904"
      + service            = "identitytoolkit.googleapis.com"
    }

  # google_project_service.frontend-api-resources["serviceusage.googleapis.com"] will be created
  + resource "google_project_service" "frontend-api-resources" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "gig-japan-398904"
      + service            = "serviceusage.googleapis.com"
    }

  # google_secret_manager_secret.frontend-secrets["environment"] will be created
  + resource "google_secret_manager_secret" "frontend-secrets" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "environment"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.frontend-secrets["firebase_api_key"] will be created
  + resource "google_secret_manager_secret" "frontend-secrets" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "firebase_api_key"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.frontend-secrets["firebase_app_id"] will be created
  + resource "google_secret_manager_secret" "frontend-secrets" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "firebase_app_id"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.frontend-secrets["firebase_auth_domain"] will be created
  + resource "google_secret_manager_secret" "frontend-secrets" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "firebase_auth_domain"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.frontend-secrets["firebase_messaging_sender_id"] will be created
  + resource "google_secret_manager_secret" "frontend-secrets" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "firebase_messaging_sender_id"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.frontend-secrets["firebase_project_id"] will be created
  + resource "google_secret_manager_secret" "frontend-secrets" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "firebase_project_id"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.frontend-secrets["firebase_storage_bucket"] will be created
  + resource "google_secret_manager_secret" "frontend-secrets" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "firebase_storage_bucket"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.frontend-secrets["user_auth"] will be created
  + resource "google_secret_manager_secret" "frontend-secrets" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "user_auth"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

Plan: 11 to add, 1 to change, 4 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"summary_plan","PRNumber":59,"Program":"tfcmt","SHA1":"4fa184f8a4db647ba6b37a1b9e1a20921b2d098a","Vars":{},"WorkflowName":"iaac_plan"} -->